src/circuits/M1/docs/M1_System_Circuit.org
#+TITLE: The M1 Processor Circuit for Sigma16
#+AUTHOR: John T. O'Donnell
# Copyright (C) 2021 John T. O'Donnell.

# #+HTML_HEAD: <link rel="stylesheet" type="text/css" href="./docstyle.css" />
# #+OPTIONS: toc:nil
# #+OPTIONS: num:nil

# #+BEGIN_EXPORT html
# <h1>The Sigma16 M1 System Circuit</h1>
# #+END_EXPORT

# The following lines include a message giving the current version
# number (VERSION.txt) and a message giving a pointer to the github
# page where the latest version can be found (LATESTVERSION).  That
# way, if a user is running an older version, the user guide will tell
# them where to go to to upgrade.

# The following version messages should come after the title but
# before the table of contents, so the version is clearly visible but
# not too long and obtrusive.

# #+INCLUDE: "../../../VERSION.txt" export html
# #+INCLUDE: "../../../COPYRIGHT.txt" export html
# #+TOC: headlines:3

* Quick start

#+BEGIN_EXAMPLE
$ cd circuits
$ ghci
ghci> :load M1/Run
ghci> :main programs/Add
Sigma16.M1> run
Sigma16.M1> quit
ghci> :quit
#+END_EXAMPLE

* Introduction

Sigma16 is a computer architecture designed for research and teaching
in computer systems.  M1 is a CPU: it is a digital circuit that
executes the Core subset of Sigma16.

M1 is a synchronous circuit designed at the level of logic gates and
flip flops.  It is specified using the Hydra hardware description
language, which describes precisely the components and how they are
connected, and which can simulate the circuit.

The Circuit directory contains the M1 circuit, which is organized as
several subsystems.  The Run module defines a simulation driver; this
is a command line text interface that provides human readable inputs
and outputs.  The ReadObj module is used to boot the system: it reads
an object code file produced by the Sigma16 assembler and
automatically generates the inputs required to make the circuit boot
the program.


* Running the system

** Installation

- Install ghc
- Install Hydra

** Configuration

There is a directory =circuits/programs= which contains several
Sigma16 programs.  The examples below use these programs, and you can
put your own programs there too.  If you do so, you can skip this
section.

However, you may wish to keep the circuits directory and your Sigma16
programs directory in different locations in your file system.  If you
do that, you may end up with long file paths to your object code, and
this can make it hard to type in the command to load a program.  The
M1 driver has a facility to make that easier.

If the file =circuits/fileprefix.txt= exists, then the text in its
first line is attached to the beginning of the file specified in the
argument to the =:main= command.  For example, suppose the full path
to your object code file is
=/some/long/path/to/your/code/MyProgram.obj.txt=.  Then you can put
=/some/long/path/to/your/code/= into =fileprefix.txt=, and then
run the program with just =:main MyProgram=.

If you don't want anything prefixed to your file arguments, either set
fileprefix.txt to a blank line, or simply delete it.

** An example program

Before examining the circuit, let's begin by taking a Sigma16 assembly
language program and running it on the circuit.  This is
=circuits/programs/Add.asm.txt=:

#+BEGIN_EXAMPLE
; Add: a minimal program that adds two integer variables
; This file is part of Sigma16; see README and https://jtod.github.io/home/Sigma16/

; Execution starts at location 0, where the first instruction will be
; placed when the program is executed.

      load   R1,x[R0]   ; R1 := x
      load   R2,y[R0]   ; R2 := y
      add    R3,R1,R2   ; R3 := x + y
      store  R3,z[R0]   ; z := x + y
      trap   R0,R0,R0   ; terminate

; Expected result: z = x + y = 23 + 14 = 37 (hex 0025)

; Static variables are placed in memory after the program

x     data  23
y     data  14
z     data   0
#+END_EXAMPLE

** Assemble the program

Computers don't run assembly language, they run machine language.  So
we need to translate the program.  There are several ways to do this:

- /Command./ If you have installed the Sigma16 tools on youc computer,
  enter this command: =sigma16 assemble programs/Add=
- /Sigma16 app./ Launch Sigma16, load the example program, assemble
  it, and save the object code in a file.  The file must be named
  =Add.obj.txt=
- /Assemble it by hand./  It's important to know /how/ to assemble a
  program by hand, and it's worth doing one or two times.  But
  once you understand how to translate from assembly to machine
  language, it's better to use the software tools.

** Run the machine code on the M1 circuit
  
Now you can run the machine language program =Add.obj.txt= on the
circuit:

- /Enter the circuits directory./ =$ cd Sigma16/src/circuits= The ghci
  command must be executed in this directory.
- /Launch Haskell./  =$ ghci=
- /Launch Hydra and M1./ =ghci> :load M1/Run=
- /Load the machine language program./ =ghci> :main programs/Add=
- /Boot the program and run it on the circuit./ =Sigma16.M1> run=
- /Leave M1 driver./  =Sigma16.M1> quit=
- /Leave ghci./ =ghci> :quit=

** Breakpoints

The machine may exectue many clock cycles before it reaches a state
that you're interested in.  For example, if you want to examine
exactly how the circuit executes a jal instruction, you need to get
through the boot process and then all the instructions that execute
before the jal.  This can take a long time, and you may have to do it
repeatedly.

The M1 simulation driver provides /breakpoints/ which alleviate this
problem.  The idea is that you specify that a bit signal of interest
is a breakpoint.  Then when you enter a run command, it will perform
clock cycles repeatedly until the breakpoint signal becomes 1.  At
that point the simulation stops and you can examine the machine state
in detail, and single step (or run) from that point on.

several t
When you start the system (e.g. :main Arrays/ArrayMax) it will take a
log of clock cycles to boot the machine language program.  If there
are n words of instructions and data, it will take n clock cycles.
It's useful to enter these commands:

#+BEGIN_EXAMPLE
  break reset
  run
#+END_EXAMPLE

This will run the simulation without stopping, until the reset signal
becomes 1, and then it will stop.  That way you can start single
stepping through the program, but don't have to single step through
the boot.

** Reference: prompts and commands

Prompts
#+BEGIN_EXAMPLE
  $             is the bash shell prompt
   ghci:        is the ghci prompt
   Sigma16.M1>  is the circuit prompt
#+END_EXAMPLE

Useful ghci commands (see ghc User Guide for full documentationO
#+BEGIN_EXAMPLE
$          is the bash shell prompt
:r         reload after editing any of the code
:q         exit ghci, go back to shell
^C         stop and return to ghci prompt
uparrow    repeat previous command
#+END_EXAMPLE


* Datapath

The datapath of a processor contains the registers, the circuits that
perform calculations (ALU and functional units), and the buses that
connect them.  All of these subsystems take control inputs that
determine their behavior.  Those control signals are generated by the
control system, which is not part of the datapath.

