src/circuits/M1/docs/M1_System_Circuit.tex
% Created 2021-10-07 Thu 19:53
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{John T. O'Donnell}
\date{\today}
\title{The M1 Processor Circuit for Sigma16}
\hypersetup{
 pdfauthor={John T. O'Donnell},
 pdftitle={The M1 Processor Circuit for Sigma16},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Quick start}
\label{sec:orgf4224c8}

\begin{verbatim}
$ cd circuits
$ ghci
ghci> :load M1/Run
ghci> :main programs/Add
Sigma16.M1> run
Sigma16.M1> quit
ghci> :quit
\end{verbatim}

\section{Introduction}
\label{sec:org123fdb7}

Sigma16 is a computer architecture designed for research and teaching
in computer systems.  M1 is a CPU: it is a digital circuit that
executes the Core subset of Sigma16.

M1 is a synchronous circuit designed at the level of logic gates and
flip flops.  It is specified using the Hydra hardware description
language, which describes precisely the components and how they are
connected, and which can simulate the circuit.

The Circuit directory contains the M1 circuit, which is organized as
several subsystems.  The Run module defines a simulation driver; this
is a command line text interface that provides human readable inputs
and outputs.  The ReadObj module is used to boot the system: it reads
an object code file produced by the Sigma16 assembler and
automatically generates the inputs required to make the circuit boot
the program.


\section{Running the system}
\label{sec:org4f15872}

\subsection{Installation}
\label{sec:org7ad5d3a}

\begin{itemize}
\item Install ghc
\item Install Hydra
\end{itemize}

\subsection{Configuration}
\label{sec:org78ee250}

There is a directory \texttt{circuits/programs} which contains several
Sigma16 programs.  The examples below use these programs, and you can
put your own programs there too.  If you do so, you can skip this
section.

However, you may wish to keep the circuits directory and your Sigma16
programs directory in different locations in your file system.  If you
do that, you may end up with long file paths to your object code, and
this can make it hard to type in the command to load a program.  The
M1 driver has a facility to make that easier.

If the file \texttt{circuits/fileprefix.txt} exists, then the text in its
first line is attached to the beginning of the file specified in the
argument to the \texttt{:main} command.  For example, suppose the full path
to your object code file is
\texttt{/some/long/path/to/your/code/MyProgram.obj.txt}.  Then you can put
\texttt{/some/long/path/to/your/code/} into \texttt{fileprefix.txt}, and then
run the program with just \texttt{:main MyProgram}.

If you don't want anything prefixed to your file arguments, either set
fileprefix.txt to a blank line, or simply delete it.

\subsection{An example program}
\label{sec:org1853d9b}

Before examining the circuit, let's begin by taking a Sigma16 assembly
language program and running it on the circuit.  This is
\texttt{circuits/programs/Add.asm.txt}:

\begin{verbatim}
; Add: a minimal program that adds two integer variables
; This file is part of Sigma16; see README and https://jtod.github.io/home/Sigma16/

; Execution starts at location 0, where the first instruction will be
; placed when the program is executed.

      load   R1,x[R0]   ; R1 := x
      load   R2,y[R0]   ; R2 := y
      add    R3,R1,R2   ; R3 := x + y
      store  R3,z[R0]   ; z := x + y
      trap   R0,R0,R0   ; terminate

; Expected result: z = x + y = 23 + 14 = 37 (hex 0025)

; Static variables are placed in memory after the program

x     data  23
y     data  14
z     data   0
\end{verbatim}

\subsection{Assemble the program}
\label{sec:org94a495b}

Computers don't run assembly language, they run machine language.  So
we need to translate the program.  There are several ways to do this:

\begin{itemize}
\item \emph{Command.} If you have installed the Sigma16 tools on youc computer,
enter this command: \texttt{sigma16 assemble programs/Add}
\item \emph{Sigma16 app.} Launch Sigma16, load the example program, assemble
it, and save the object code in a file.  The file must be named
\texttt{Add.obj.txt}
\item \emph{Assemble it by hand.}  It's important to know \emph{how} to assemble a
program by hand, and it's worth doing one or two times.  But
once you understand how to translate from assembly to machine
language, it's better to use the software tools.
\end{itemize}

\subsection{Run the machine code on the M1 circuit}
\label{sec:orga8861eb}

Now you can run the machine language program \texttt{Add.obj.txt} on the
circuit:

\begin{itemize}
\item \emph{Enter the circuits directory.} \texttt{\$ cd Sigma16/src/circuits} The ghci
command must be executed in this directory.
\item \emph{Launch Haskell.}  \texttt{\$ ghci}
\item \emph{Launch Hydra and M1.} \texttt{ghci> :load M1/Run}
\item \emph{Load the machine language program.} \texttt{ghci> :main programs/Add}
\item \emph{Boot the program and run it on the circuit.} \texttt{Sigma16.M1> run}
\item \emph{Leave M1 driver.}  \texttt{Sigma16.M1> quit}
\item \emph{Leave ghci.} \texttt{ghci> :quit}
\end{itemize}

\subsection{Breakpoints}
\label{sec:org272c6e7}

The machine may exectue many clock cycles before it reaches a state
that you're interested in.  For example, if you want to examine
exactly how the circuit executes a jal instruction, you need to get
through the boot process and then all the instructions that execute
before the jal.  This can take a long time, and you may have to do it
repeatedly.

The M1 simulation driver provides \emph{breakpoints} which alleviate this
problem.  The idea is that you specify that a bit signal of interest
is a breakpoint.  Then when you enter a run command, it will perform
clock cycles repeatedly until the breakpoint signal becomes 1.  At
that point the simulation stops and you can examine the machine state
in detail, and single step (or run) from that point on.

several t
When you start the system (e.g. :main Arrays/ArrayMax) it will take a
log of clock cycles to boot the machine language program.  If there
are n words of instructions and data, it will take n clock cycles.
It's useful to enter these commands:

\begin{verbatim}
break reset
run
\end{verbatim}

This will run the simulation without stopping, until the reset signal
becomes 1, and then it will stop.  That way you can start single
stepping through the program, but don't have to single step through
the boot.

\subsection{Reference: prompts and commands}
\label{sec:org9182d3c}

Prompts
\begin{verbatim}
$             is the bash shell prompt
 ghci:        is the ghci prompt
 Sigma16.M1>  is the circuit prompt
\end{verbatim}

Useful ghci commands (see ghc User Guide for full documentationO
\begin{verbatim}
$          is the bash shell prompt
:r         reload after editing any of the code
:q         exit ghci, go back to shell
^C         stop and return to ghci prompt
uparrow    repeat previous command
\end{verbatim}


\section{Datapath}
\label{sec:org89ea49c}

The datapath of a processor contains the registers, the circuits that
perform calculations (ALU and functional units), and the buses that
connect them.  All of these subsystems take control inputs that
determine their behavior.  Those control signals are generated by the
control system, which is not part of the datapath.
