src/circuits/M1/docs/M1_System_Circuit.org
** ALU

The ALU (arithmetic and logic unit) is a combinational circuit that
performs calculations which can be completed efficiently in one clock
cycle.  The ALU performs integer additions, subtractions, comparisons,
and the the like.  However, more complex operations, such as
multiplication, division, and all floating point operations, require
more than one clock cycle.  They also require some additional state
(registers), and are typically performed in functional units.


The ALU calculates a function of word inputs x and y (which are
usually the contents of two registers) and cc (the contents of R15).
It produces a word output r, which is a numeric result (typically
loaded into the destination register), and a comparison result ccnew
which is the new value to be loaded into the condition code register.
The ALU performs addition, subtraction, negation, increment, and
comparision.  The function is determined by two control signals (alua,
alub).

Furthermore, the ALU receives ir_d as an input and uses it to output
cond, which is the bit in cc indexed by ir_d.  This is used by jumpc0
and jumpc1.

Control inputs:
-  alua, alub
Data inputs:
-  x
-  y
-  cc
-  ir_d
Data outputs:
-  r      = function (a,b) x y cc
-  ccnew  = compare x y cc
-  cond   = R15.ir_d  (use ir_d to select bit from condition code)

The data output r is the result of an arithmetic operation which
is determinted by the control inputs:


op = (alua, alub,  aluc)

| a b c | r   |
|-------+-----|
| 0 0 0 | x+y |
| 0 0 1 | x-y |
| 0 1 0 | -x  |
| 0 1 1 | x+1 |
| 1 0 0 | cmp |

The control algorithm defines all control signals, regardless of what
operation is being performed.


Sigma16 defines the following condition code flags.

| bit index | Relation        | Symbol |
|-----------+-----------------+--------|
|         0 | > Int           | g      |
|         1 | > Nat           | G      |
|         2 | =               | =      |
|         3 | < Nat           | L      |
|         4 | < Int           | <      |
|         5 | Int overflow    | v      |
|         6 | Nat overflow    | V      |
|         7 | Carry           | C      |
|         8 | Stack overflow  | S      |
|         9 | Stack underflow | s      |


/Defining equation for ALU./

#+BEGIN_EXAMPLE
alu n (alua,alub,aluc) x y cc d = (sum, ccnew, cond)
  where
-- Constant words    
    wzero = fanout n zero
    wone = boolword n one
#+END_EXAMPLE

/Determine type of function being evaluated./

#+BEGIN_EXAMPLE
    arith = inv alua  -- doing arithmetic operation, alu abc one of 000 001 010 100
    negating = and2 (inv alua) (xor2 alub aluc)  -- alu abc = 001 or 010
    comparing = and3 alua (inv alub) (inv aluc)  -- doing comparison, alu abc = 100
#+END_EXAMPLE

/Prepare inputs to adder./

#+BEGIN_EXAMPLE
    x' = mux2w (alub,aluc) x x wzero x
    y' = mux2w (alub,aluc) y (invw y) (invw x) wone
#+END_EXAMPLE

/The adder./

#+BEGIN_EXAMPLE
    xy = bitslice2 x' y'
    (carry,sum) = rippleAdd negating xy
    msb = sum!!0 --- most significant bit of sum
#+END_EXAMPLE

/Binary comparison./

#+BEGIN_EXAMPLE
    (lt,eq,gt) = rippleCmp xy
#+END_EXAMPLE

/Two's complement comparison./

#+BEGIN_EXAMPLE
    lt_tc = mux2 (xy!!0) lt zero one lt
    eq_tc = eq
    gt_tc = mux2 (xy!!0) gt one zero gt
#+END_EXAMPLE

/Carry and overflow./

#+BEGIN_EXAMPLE
    natovfl = carry           -- natural (binary) overflow if carry = 1
    intovfl = xor2 carry msb  -- integer (2's comp) overflow if carry != msb
    noOvfl  = inv intovfl   -- no integer overflow, integer result is ok
#+END_EXAMPLE

/Relation of integer result to 0./

#+BEGIN_EXAMPLE
    any1 = orw sum         -- 1 if any bit in sum is 1
    neg  = and3 noOvfl any1 msb        -- ok, result < 0
    z    = and2 noOvfl (inv any1)      -- ok, result is 0
    pos  = and3 noOvfl any1 (inv msb)  -- ok, result > 0
#+END_EXAMPLE

/Overflow flags: don't indicate overflow for a comparison operation./

#+BEGIN_EXAMPLE
    fcarry   = and2 arith carry
    fnatovfl = and2 arith natovfl
    fintovfl = and2 arith intovfl
#+END_EXAMPLE

/Comparison flags: for arithmetic, indicate comparison with 0./

#+BEGIN_EXAMPLE
    flt      = mux1 arith lt    zero
    flt_tc   = mux1 arith lt_tc neg
    feq      = mux1 arith eq    z
    fgt      = mux1 arith gt    pos
    fgt_tc   = mux1 arith gt_tc pos
#+END_EXAMPLE

/Generate the condition code./

#+BEGIN_EXAMPLE
    ccnew = [ zero,   zero,     zero,     zero,    -- bit 15 14 13 12
              zero,   zero,     zero,     zero,    -- bit 11 10  9  8
              fcarry, fnatovfl, fintovfl, flt_tc,  -- bit  7  6  5  4
              flt,    feq,      fgt,      fgt_tc   -- bit  3  2  1  0
            ]
#+END_EXAMPLE

/Conditional bit controls conditional jumps./

#+BEGIN_EXAMPLE
    cond = indexbit d cc
#+END_EXAMPLE

Small helper circuits:
- =indexbit cs xs= selects the element at index cs from xs, where
  index 0 is least significant position; require that length xs = 2 ^
  length cs
- =mux4 cs xs= selects the element at index cs from xs; require that
  =length xs = 2 ^ cs=

** Basic register file

#+BEGIN_EXAMPLE
regfile1
  :: CBit a   -- sequential circuit with signal type a
  => Int      -- k is number of reg address bits, with 2^k registers
  -> a        -- ld.  if ld then reg[d] := x
  -> [a]      -- d is destination address, register to load
  -> [a]      -- sa is source address a, first operand to fetch
  -> [a]      -- sb is source address b, second operand to fetch
  -> a        -- x is data to load into reg[d] if ld=1
  -> (a,a)    -- (reg[sa], reg[sb]) is the readouts of two registers
#+END_EXAMPLE

#+BEGIN_EXAMPLE
regfile1 k ld d sa sb x
  | k==0 = (r,r)
  | k>0  = (a,b)
  where
    r = reg1 ld x
    (a0,b0) = regfile1 (k-1) ld0 ds sas sbs x
    (a1,b1) = regfile1 (k-1) ld1 ds sas sbs x
    (ld0,ld1) = demux1 d1 ld
    a = mux1 sa1 a0 a1
    b = mux1 sb1 b0 b1
    (d1:ds) = d
    (sa1:sas) = sa
    (sb1:sbs) = sb
#+END_EXAMPLE

The regfile1 circuit has $2^{k}$ words, each consisting of 1 bit.  A
full register file with $n$-bit words simply consists of $n$ copies of
the regfile1 circuit.

#+BEGIN_EXAMPLE
regfile :: CBit a => Int -> Int
  -> a -> [a] -> [a] -> [a] -> [a] -> ([a],[a])
regfile n k ld d sa sb x =
   unbitslice2 [regfile1 k ld d sa sb (x!!i)  | i <- [0..n-1]]
#+END_EXAMPLE


