src/circuits/M1/docs/M1_System_Circuit.tex

\subsection{ALU}
\label{sec:org2ff0a37}

The ALU (arithmetic and logic unit) is a combinational circuit that
performs calculations which can be completed efficiently in one clock
cycle.  The ALU performs integer additions, subtractions, comparisons,
and the the like.  However, more complex operations, such as
multiplication, division, and all floating point operations, require
more than one clock cycle.  They also require some additional state
(registers), and are typically performed in functional units.


The ALU calculates a function of word inputs x and y (which are
usually the contents of two registers) and cc (the contents of R15).
It produces a word output r, which is a numeric result (typically
loaded into the destination register), and a comparison result ccnew
which is the new value to be loaded into the condition code register.
The ALU performs addition, subtraction, negation, increment, and
comparision.  The function is determined by two control signals (alua,
alub).

Furthermore, the ALU receives ir\textsubscript{d} as an input and uses it to output
cond, which is the bit in cc indexed by ir\textsubscript{d}.  This is used by jumpc0
and jumpc1.

Control inputs:
\begin{itemize}
\item alua, alub
\end{itemize}
Data inputs:
\begin{itemize}
\item x
\item y
\item cc
\item ir\textsubscript{d}
\end{itemize}
Data outputs:
\begin{itemize}
\item r      = function (a,b) x y cc
\item ccnew  = compare x y cc
\item cond   = R15.ir\textsubscript{d}  (use ir\textsubscript{d} to select bit from condition code)
\end{itemize}

The data output r is the result of an arithmetic operation which
is determinted by the control inputs:


op = (alua, alub,  aluc)

\begin{center}
\begin{tabular}{ll}
a b c & r\\
\hline
0 0 0 & x+y\\
0 0 1 & x-y\\
0 1 0 & -x\\
0 1 1 & x+1\\
1 0 0 & cmp\\
\end{tabular}
\end{center}

The control algorithm defines all control signals, regardless of what
operation is being performed.


Sigma16 defines the following condition code flags.

\begin{center}
\begin{tabular}{rll}
bit index & Relation & Symbol\\
\hline
0 & > Int & g\\
1 & > Nat & G\\
2 & = & =\\
3 & < Nat & L\\
4 & < Int & <\\
5 & Int overflow & v\\
6 & Nat overflow & V\\
7 & Carry & C\\
8 & Stack overflow & S\\
9 & Stack underflow & s\\
\end{tabular}
\end{center}


\begin{verbatim}
alu n (alua,alub,aluc) x y cc d = (sum, ccnew, cond)
  where
    negating = and2 (inv alua) (xor2 alub aluc)  -- alu abc = 001 or 010
    arith = inv alua  -- doing arithmetic operation, alu abc one of 000 001 010 100
    comparing = and3 alua (inv alub) (inv aluc)  -- doing comparison, alu abc = 100
    wzero = fanout n zero
    wone = boolword n one
-- prepare inputs to adder    
    x' = mux2w (alub,aluc) x x wzero x
    y' = mux2w (alub,aluc) y (invw y) (invw x) wone
    xy = bitslice2 x' y'
    (carry,sum) = rippleAdd negating xy
-- binary comparison    
    (lt,eq,gt) = rippleCmp xy
-- two's complement comparison    
    lt_tc = mux2 (xy!!0) lt zero one lt
    eq_tc = eq
    gt_tc = mux2 (xy!!0) gt one zero gt
-- carry and overflow
    natovfl = carry
    intovfl = zero -- ????
-- condition code flags
    fcarry = and2 carry (inv comparing)
    fnatovfl = and2 natovfl (inv comparing)
    fintovfl = and2 intovfl (inv comparing)
    ccnew = [ zero,   zero,     zero,     zero,   -- bit 15 14 13 12
              zero,   zero,     zero,     zero,   -- bit 11 10  9  8
              fcarry, fnatovfl, fintovfl, lt_tc,  -- bit  7  6  5  4
              lt,     eq,       gt,       gt_tc   -- bit  3  2  1  0
            ]
-- conditional bit controls conditional jumps            
    cond = indexbit d cc
\end{verbatim}

-- indexbitcs xs: select element at index cs from xs, where index 0 is
-- least significant position; require that length xs = 2 \^{} length cs

indexbit :: Bit a => [a] -> [a] -> a
indexbit [] [x] = x
indexbit (c:cs) xs =
  mux1 c (indexbit cs (drop i xs))
         (indexbit cs (take i xs))
  where i = 2 \^{} length cs

-- mux4 cs xs: select element at index cs from xs; require that length
-- xs = 2 \^{} length cs

muxw :: Bit a => [a] -> [a] -> a
muxw [] [x] = x
muxw (c:cs) xs =
  mux1 c (muxw cs (take i xs))
         (muxw cs (drop i xs))
  where i = 2 \^{} length cs


\subsubsection{Condition codes}
\label{sec:org6c98e44}


\begin{verbatim}
--    comparing = and3 a b (or2 c d)
--    comp_bool = mux2 (c,d) zero lt_tc eq_tc gt_tc
--    comp_word = boolword n comp_bool
--    z = mux1w comparing sum comp_word
\end{verbatim}


\subsection{Basic register file}
\label{sec:org8779f76}

\begin{verbatim}
regfile1
  :: CBit a   -- sequential circuit with signal type a
  => Int      -- k is number of reg address bits, with 2^k registers
  -> a        -- ld.  if ld then reg[d] := x
  -> [a]      -- d is destination address, register to load
  -> [a]      -- sa is source address a, first operand to fetch
  -> [a]      -- sb is source address b, second operand to fetch
  -> a        -- x is data to load into reg[d] if ld=1
  -> (a,a)    -- (reg[sa], reg[sb]) is the readouts of two registers
\end{verbatim}

\begin{verbatim}
regfile1 k ld d sa sb x
  | k==0 = (r,r)
  | k>0  = (a,b)
  where
    r = reg1 ld x
    (a0,b0) = regfile1 (k-1) ld0 ds sas sbs x
    (a1,b1) = regfile1 (k-1) ld1 ds sas sbs x
    (ld0,ld1) = demux1 d1 ld
    a = mux1 sa1 a0 a1
    b = mux1 sb1 b0 b1
    (d1:ds) = d
    (sa1:sas) = sa
    (sb1:sbs) = sb
\end{verbatim}

The regfile1 circuit has \(2^{k}\) words, each consisting of 1 bit.  A
full register file with \$n\$-bit words simply consists of \(n\) copies of
the regfile1 circuit.

\begin{verbatim}
regfile :: CBit a => Int -> Int
  -> a -> [a] -> [a] -> [a] -> [a] -> ([a],[a])
regfile n k ld d sa sb x =
   unbitslice2 [regfile1 k ld d sa sb (x!!i)  | i <- [0..n-1]]
\end{verbatim}
