src/circuits/M1/docs/M1_System_Circuit.tex


\subsection{Handling R0 and R15}
\label{sec:org0f3e9d7}

The basic register file treats all registers the same.  However,
Sigma16 treats R0 and R15 as special cases:

\begin{itemize}
\item R0 is always 0.  It is legal to load another value into it, but any
readout of R0 will yield 0.

\item R15 is the condition code.  It holds the result of the cmp
instruction.  Furthermore, arithmetic instructions (which place
their result in the register specified by \texttt{Reg[ir\_d]}) also set some
flags in the condition code indicating overflow and other
conditions.  The conditional jump instructions automatically fetch
bits from R15.
\end{itemize}

There are several ways the circuit could handle R0.  M1 uses the best
approach: R0 does not actully have any flip flops.  A load into R0 is
simply discarded, and the combinational logic for fetching a register
produces the value 0 when R0 is fetched.  This approach is  relatively
simple to implement, and the resulting circuit consumes less power and
requires less chip area than alternatives that use flip flops to  hold
the irrelevant state of R0.

R15, which holds the condition code, is more complex.  There are two
reasons:
\begin{itemize}
\item The machine may need to read out both R15 and some other register at
the same time.
\item The machine may need to load a new value into both R15 and some
other register at the same time.
\end{itemize}

Both of these requirements cannot be satisfied with the basic register
file circuit.  Instead, it would be necessary to use two clock cycles.

It would be possible to handle the condition code by using two clock
cycles for arithmetic instructionss, one to put the result into the
destination register and another to put the condition code into R15.
However, add instructions are frequently executed, and this would give
an unacceptable slowdown.  (The M1 circuit is designed to be as simple
as possible, but more advanced circuits should be possible with the
architecture.)

It is critically important to be able

Register file with special treatment of R0 and R15

\begin{itemize}
\item reg[0] always outputs 0
\item reg[15] is always output, and can be loaded independently from other registers
\end{itemize}

Effect on state (from programmer's perspective)
\begin{itemize}
\item if ld                   then reg[d] := x
\item if \textasciitilde{}(ld \& d=15) \& ldcc  then reg[15] := xcc
\end{itemize}

State update (from perspective of circuit)
\begin{itemize}
\item reg[0] there is no state
\item reg[d] for 0 < d < 15:  reg[d] := if ld then x else reg[d]
\item reg[15] :=
\end{itemize}

\begin{verbatim}
if ld & d=15 then x
else if ldcc then xcc
else reg[15]
\end{verbatim}


\begin{verbatim}
Inputs
  ld     load control
  ldcc   load into R15
  x      data input
  xcc    R15 data input
  d      destination address
  sa     source a address
  sb     source b address

Outputs
  a = reg[sa]
  b = reg[sb]
  cc = reg[15]
\end{verbatim}

\subsection{Implementing the register file with special cases}
\label{sec:orgd5c7fdb}

Recursion is controlled by the addresses; if their lengths vary there
will be a pattern match error

RFspan determines how to generate the circuit for the base cases

\begin{verbatim}
data RFspan
  = RFfull      -- contains R0
  | RFhead       -- contains R15
  | RFtail       -- contains R15
  | RFinside     -- contains neither R0 nor R15
\end{verbatim}

\begin{verbatim}
headType, tailType :: RFspan -> RFspan
headType RFfull   = RFhead
headType RFinside = RFinside
headType RFhead   = RFhead
headType RFtail   = RFinside

tailType RFfull   = RFtail
tailType RFinside = RFinside
tailType RFhead   = RFinside
tailType RFtail   = RFtail
\end{verbatim}

-- 1-bit Register file with special cases for lowest and highest
-- indices (R0, cc).  Sigma16 uses 4-bit addresses for d, sa, sb,
-- leading to 16 registers, where the special cases are R0 (the head,
-- i.e. lowest address) and R15 (the tail, i.e. highest address)

\begin{verbatim}
regFileSpec1
  :: CBit a
  => RFspan
  -> a           -- ld: if ld then reg[d] := x
  -> a           -- ldcc: if ldcc then reg[15] := xcc (but ld R15 takes precedence)
  -> [a]         -- d: destination address
  -> [a]         -- sa: source a address
  -> [a]         -- sb: source b address
  -> a           -- x = data input for reg[d]
  -> a           -- xcc = data input for condition code R15
  -> (a,a,a)     -- (reg[sa], reg[sb], reg[15])
\end{verbatim}

-- Recursion is based on the address words.  There will be a pattern
-- match error if the addresses (d, sa, sb) don't all have the same
-- number of bits.  There will also be a pattern match error if the
-- base case has RFtype = RFfull, as a singleton register cannot be
-- both R0 and R15.

-- Base cases

\begin{verbatim}
regFileSpec1 RFinside ld ldcc [] [] [] x xcc = (r,r,zero)
  where r = reg1 ld x
regFileSpec1 RFhead ld ldcc [] [] [] x xcc = (zero,zero,zero)
regFileSpec1 RFtail ld ldcc [] [] [] x xcc = (r,r,r)
  where r = reg1 (or2 ld ldcc) (mux1 ld xcc x)
\end{verbatim}

-- Recursion case

\begin{verbatim}
regFileSpec1 rft ld ldcc (d:ds) (sa:sas) (sb:sbs) x xcc = (a,b,cc)
  where (a0,b0,cc0) = regFileSpec1 (headType rft) ld0 ldcc ds sas sbs x xcc
        (a1,b1,cc1) = regFileSpec1 (tailType rft) ld1 ldcc ds sas sbs x xcc
        (ld0,ld1) = demux1 d ld
        a = mux1 sa a0 a1
        b = mux1 sb b0 b1
        cc = cc1
\end{verbatim}

-- n-bit register file with special cases for R0 and R15

\begin{verbatim}
regFileSpec
  :: CBit a
  => Int             -- word size
  -> a               -- ld: if ld then reg[d] := x
  -> a               -- ldcc: load R15
  -> [a]             -- d: destination address
  -> [a]             -- sa: source a address
  -> [a]             -- sb: source b address
  -> [a]             -- x = data input for reg[d]
  -> [a]             -- xcc = data input for condition code R15
  -> ([a],[a],[a])  -- (reg[sa], reg[sb], reg[15])
\end{verbatim}

\begin{verbatim}
regFileSpec n ld ldcc d sa sb x xcc =
  unbitslice3 [regFileSpec1 RFfull ld ldcc d sa sb (x!!i) (xcc!!i)
                 | i <- [0 .. n - 1]]
\end{verbatim}


\section{Control}
\label{sec:orgd158294}
\subsection{Control state: basic delay elements}
\label{sec:org87adaae}

\begin{verbatim}
st_a = dff ...
st_b = dff st_a
st_c = dff st_b
st_d = dff st_c
...
\end{verbatim}

\begin{verbatim}
st_dispatch = dff ...
ps = demux4 op st_a

st_a0 = dff (ps!!0)  -- op=0000 indicates operation a
st_a1 = dff st_a0
st_a2 = dff st_a1

st_b0 = dff (ps!!1)  -- op=0001 indicates operation b
st_b1 = dff st_a0
st_b2 = dff st_a1

st_c0 = dff (ps!!2)  -- op=0010 indicates operation b
st_c1 = dff st_c0
st_c2 = dff st_c1
...

st_z0 = dff (ps!!15)  -- op=1111 indicates operation z
st_z1 = dff st_z0
st_z2 = dff st_z1
...
\end{verbatim}

\subsection{Basic delay elemeent method for control}
\label{sec:orgd5100f6}

There are many ways to synthesize a control circuit from a control
algorithm.  A simple approach is the delay element method.

For example, consider the chain of states for the load instruction.
In the basic delay element method (which doesn't provide for DMA cycle
stealing), the states would be defined like this, and The control
signals are generated directly from those states:

\begin{verbatim}
dff_load0 = dff (pRX!!1)
dff_load1 = dff st_load0
dff_load2 = dff st_load1
\end{verbatim}

The control signals are generated by the states.  For example, suppose
\begin{itemize}
\item State \texttt{dff\_load0} asserts \texttt{c1} and \texttt{c2}
\item State \texttt{load1} asserts \texttt{c3}
\item State \texttt{load2} asserts \texttt{1c} and \texttt{c3}
\end{itemize}
Then the controls are defined by
\begin{itemize}
\item =c1 = orw [dff=load0, dff\textsubscript{load2}]
\item =c2 = orw [dff\textsubscript{load1}]
\item =c3 = orw [dff\textsubscript{load0}, dff\textsubscript{load2}]
\end{itemize}
