src/circuits/M1/docs/M1_System_Circuit.tex


\subsection{Enhanced delay elements for DMA and cycle stealing}
\label{sec:org648e636}

Direct memory access (DMA) is a method for supporting Input/Output.
An input operation requires data from an input device to be stored
into the memory.  An output operation is the reverse: data must be
fetched from memory and sent to an output device.

One way to implement I/O is to require the CPU to perform the memory
accesses during an I/O operation.  This method was actually used on
some very early computers (1940s), but it is extremely slow, and is
not used on modern computers.

DMA is far more efficient.  The idea is that the processor doesn't
access the memory for I/O.  Instead, it makes a request for input or
output; this means simply sending a small message to the I/O system.
The I/O system then performs its own accesses to the memory.

For example ``print 80 characters in memory starting at address
2bc3''.  Sigma16 makes this request using a trap instruction: trap
R1,R2,R3 specifies the operation by a number in R1, and arguments in
R2 and R3.  For example, if R1 contains 1 (the trap code for write),
thhis tells the I/O system to print the contents of memory starting at
the address in R2, and the number of characters is given in R3.

The main technical issue in DMA is that both the processor and the I/O
system are making accesses to the memory, and these are likely to
happen at the same time.  The memory itself, however, can do only one
operation at a time.  Therefore it is necessary to ensure that the
processor and I/O do not interfere with each other.

Suppose the I/O controller needs to fetch a memory location x.  To do
so, the system needs to set some control signals, and place x on the
memory address control.  But these actions could interfere with normal
execution of the processor.  If the processor happens to be accessing
memory at some other address, there will be a conflict.

How can we resolve a confliict between the I/O system and the
processor when both want to access memory at the same time?  There are
two general approaches: cycle stealing and a separate memory
management unit.  The M1 system uses cycle stealing.

The idea behind cycle stealing is that during every clock cycle,
either the processor or the memory is performing an action, but never
both.  In this context, ``action'' means changing the state by putting
new values into the flip flops.

The main system controller provides a signal DMA that indicates
whether the processor or the I/O can perform a memory operation during
the current cycle.  If DMA is 0 the processor should operate
normally.  If DMA is 1 the I/O system can access the memory, and the
CPU should leave its state unchanged at the next clock tick.

In the basic delay element method, the system will definitly set all
the control signals corresponding to the current state.  However, we
need to
\begin{itemize}
\item Set all the processor's control signals to 0 during a cycle when DMA=1.
\item Leave the control state unchanged at the next clock tick.  That
enables the processor to retry its current operation in the next
clock cycle.
\end{itemize}


To achieve this, two signals are defined for every state: a flip flop
which represents ``the processor is trying to be in this statee,
unless the cycle has been stolen'', and a logic signal that means
``the processor is in charge this cycle and is actually generating
control signals''.

This 
To support cycle stealing, there is a dff for each state
(e.g. \texttt{dff\_load0}) and an additional signal (\texttt{st\_load0}) that is 1 if
the flip flip is 1 and the cycle is not stolen.  If \texttt{dff\_load0} is 1
it means that the processor needs to execute this state.  If
\texttt{st\_load0} is 1 it means the processor actually is in this state and
its control signals can be asserted.

\begin{verbatim}
dff_load0 = dff (or2 (pRX!!1) (and2 dff_load0 io_DMA))
st_load0  = and2 dff_load0 cpu
dff_load1 = dff (or2 st_load0 (and2 dff_load1 io_DMA))
st_load1  = and2 cpu dff_load1
dff_load2 = dff (or2 st_load1 (and2 dff_load2 io_DMA))
st_load2  = and2 cpu dff_load2
\end{verbatim}

Suppose \texttt{io\_DNA} is 0 for a  number of clock cycles, and the machine
is dispatching an instruction with secondary opcide 1.  That indicates
a \texttt{load} instruction, and .  Consider what happens during
a sequence of clock cycles.
\begin{itemize}
\item Suppose that during cycle 100 \texttt{pRX!!1} is 1.
\item Cycle 101
\begin{itemize}
\item At the clock tick beginning the cycle, \texttt{dff\_load0} will become 1
\item Suppose that during cycle 101, \texttt{io\_DMA} is 1, so \texttt{cpu} is 1.
Since \texttt{dff\_load0} is 1, \texttt{st\_load0} is also 1, and the control
signals for the \texttt{load0} state will all be 1.  The processor will
perform the first step of the \texttt{load} instruction.  What that
really means is that any flip flop changes required will occur st
the clock tick that ends Cycle 101 and begins cycle 102.
\end{itemize}
\item Cycle 102
\begin{itemize}
\item At the clock tick between cycles 101 and 102, \texttt{dff\_load1} becomes
1 and \texttt{dff\_load0} becomes 0.
\item But suppose that the  I/O system needs to steal the cycle to do
its own memory access.  To do this, the system sets \texttt{io\_DNA} = 1m
and that makes \texttt{cpu} = 0.
\item Although \texttt{dff\_load1} = 1, the corresponding signal \texttt{st\_load1} is 0
during this cycle.  This is because \texttt{st\_load1 = and2 cpu
    dff\_load1} and the value of \texttt{cpu} is 0.  Consequently, the control
signals set byy \texttt{st\_load1} all remain 0.  Any register updates
belonging to \texttt{st=load1} will not happen at the next clock tick.
Notice that all the cominbational logic calculations for
\texttt{st\_load1} will go ahead; but their results will not be latched
into any register at the clock tick.  These logic calculations
will be repeated during the next clock cycle.
\item Because the processor will not update any registers at the end of
the cycle, it is safe for the I/O to set the controls for the
memory that it needs, as well as the memory address and data words.
\item At the clock tick ending this cycle, the I/O memory access takes
place and the processor does nothing: its cycle has been stolen.
\end{itemize}
\item 
\end{itemize}

\section{System}
\label{sec:orgc1afc92}
\end{document}
